"10000"="Shooting Mode";
"10001"="Tv( Shutter Speed )";
"10002"="Av( Aperture Value )";
"10003"="AF Mode";
"10004"="Flash Exposure Compensation";
"10005"="Exposure Compensation";
"10006"="Autoexposure Bracketing";
"10007"="Metering Mode";
"10008"="White Balance Mode";
"10009"="Lens";
"10010"="AF Microadjustment";
"10011"="Focal Length";
"10012"="Flash";
"10013"="Image Size";
"10014"="Image Quality";
"10015"="Focusing Point";
"10016"="Red-eye Reduction";
"10017"="Parameters Settings";
"10018"="Drive Mode";
"10019"="GPS Data";
"10020"="Owner's Name";
"10021"="Camera Body No.";
"10022"="Beep";
"10023"="Custom Function";
"10024"="White balance compensation";
"10025"="JPEG quality";
"10026"="Digital Exposure Compensation";
"10027"="Saved File Name";
"10028"="File Name";
"10029"="Camera Model";
"10030"="Shooting Date/Time";
"10031"="ISO Speed";
"10032"="Digital Zoom";
"10033"="Image Stabilizer";
"10034"="Movie";
"10035"="Recording Time  %d.%d";
"10036"="Frame Rate      ";
"10037"="Flash Type";
"10038"="Shutter curtain sync";
"10039"="Active AF Points";
"10040"="File Size";
"10041"="File Number";
"10042"="Macro";
"10043"="Landscape";
"10044"="ISO Speed Bracketing";
"10045"="White Balance Bracketing";
"10046"="Color Matrix";
"10047"="Noise Reduction";
"10048"="Photo Effect Mode";
"10049"="Flash Quantity";
"10050"="AF Range Mode";
"10051"="Color Space";
"10052"="SuperMacro";
"10053"="    01:Long exposure noise reduction";
"10054"="    02:Shutter button/AE lock button";
"10055"="    03:Mirror lockup";
"10056"="    04:TV,AV and exposure level";
"10057"="    05:AF-assist light";
"10058"="    06:Shutter speed in Av mode";
"10059"="    07:AEB sequence/auto cancellation";
"10060"="    08:Shutter curtain sync";
"10061"="    09:Lens AF stop button Fn, switch";
"10062"="    10:Auto reduction of fill flash";
"10063"="    11:Menu button return position";
"10064"="    12:SET button func, when shooting";
"10065"="    13:Sensor cleaning";
"10066"="    14:Superimposed display";
"10067"="    15:Shutter release without CF card";
"10068"="    05:AF-assist beam/Flash firing";
"10069"="    00:Focusing Screen";
"10070"="    01:Finder display during exposure";
"10071"="    02:Shutter release without CF card";
"10072"="    03:ISO speed expansion";
"10073"="    04:Shutter button/AE lock button";
"10074"="    05:Manual Tv/Av set. for M exp.";
"10075"="    06:Exposure level increments";
"10076"="    07:USM lens electronic MF";
"10077"="    08:Top LCD panel/Back LCD panel";
"10078"="    09:Auto bracketing sequence/cancel";
"10079"="    10:AF point illumination";
"10080"="    11:AF point selection method";
"10081"="    12:Mirror lockup";
"10082"="    13:Number AF points/Spot metering";
"10083"="    14:Auto reduction of fill flash";
"10084"="    15:Shutter curtain synchronization";
"10085"="    16:Safety shift in Av or Tv";
"10086"="    17:AF point activation area";
"10087"="    18:Switch to registered AF point";
"10088"="    19:Lens AF stop button function";
"10089"="    20:AI SERVO tracking sensitivity";
"10090"="Auto";
"10091"="Program AE";
"10092"="Shutter-Priority AE";
"10093"="Aperture-Priority AE";
"10094"="Manual Exposure";
"10095"="A-DEP";
"10096"="Depth-of-Field AE";
"10097"="Bulb";
"10098"="Auto";
"10099"="Manual";
"10100"="Landscape";
"10101"="Fast Shutter";
"10102"="Slow Shutter";
"10103"="Night Scene";
"10104"="Black & White";
"10105"="Sepia";
"10106"="Portrait";
"10107"="Sports";
"10108"="Macro( Close Up )";
"10109"="Pan Focus";
"10110"="Stitch Assist";
"10111"="Movie";
"10112"="Vivid";
"10113"="Neutral";
"10114"="Black & White";
"10115"="Flash Off(Never fires.)";
"10116"="Long Shutter";
"10117"="Macro";
"10118"="Bulb Exposure Mode";
"10119"="30";
"10120"="25";
"10121"="20";
"10122"="20";
"10123"="15";
"10124"="13";
"10125"="10";
"10126"="10";
"10127"="8";
"10128"="6";
"10129"="6";
"10130"="5";
"10131"="4";
"10132"="3.2";
"10133"="3";
"10134"="2.5";
"10135"="2";
"10136"="1.6";
"10137"="1.5";
"10138"="1.3";
"10139"="1";
"10140"="0.8";
"10141"="0.7";
"10142"="0.6";
"10143"="0.5";
"10144"="0.4";
"10145"="0.3";
"10146"="0.3";
"10147"="1/4";
"10148"="1/5";
"10149"="1/6";
"10150"="1/6";
"10151"="1/8";
"10152"="1/10";
"10153"="1/10";
"10154"="1/13";
"10155"="1/15";
"10156"="1/20";
"10157"="1/20";
"10158"="1/25";
"10159"="1/30";
"10160"="1/40";
"10161"="1/45";
"10162"="1/50";
"10163"="1/60";
"10164"="1/80";
"10165"="1/90";
"10166"="1/100";
"10167"="1/125";
"10168"="1/160";
"10169"="1/180";
"10170"="1/200";
"10171"="1/250";
"10172"="1/320";
"10173"="1/350";
"10174"="1/400";
"10175"="1/500";
"10176"="1/640";
"10177"="1/750";
"10178"="1/800";
"10179"="1/1000";
"10180"="1/1250";
"10181"="1/1500";
"10182"="1/1600";
"10183"="1/2000";
"10184"="1/2500";
"10185"="1/3000";
"10186"="1/3200";
"10187"="1/4000";
"10188"="1/5000";
"10189"="1/6000";
"10190"="1/6400";
"10191"="1/8000";
"10192"="1/10000";
"10193"="1/12000";
"10194"="1/12800";
"10195"="1/16000";
"10196"="1.0";
"10197"="1.1";
"10198"="1.2";
"10199"="1.2";
"10200"="1.4";
"10201"="1.6";
"10202"="1.8";
"10203"="1.8";
"10204"="2.0";
"10205"="2.2";
"10206"="2.5";
"10207"="2.5";
"10208"="2.8";
"10209"="3.2";
"10210"="3.5";
"10211"="3.5";
"10212"="4.0";
"10213"="4.5";
"10214"="4.5";
"10215"="5.0";
"10216"="5.6";
"10217"="6.3";
"10218"="6.7";
"10219"="7.1";
"10220"="8.0";
"10221"="9.0";
"10222"="9.5";
"10223"="10";
"10224"="11";
"10225"="13";
"10226"="13";
"10227"="14";
"10228"="16";
"10229"="18";
"10230"="19";
"10231"="20";
"10232"="22";
"10233"="25";
"10234"="27";
"10235"="29";
"10236"="32";
"10237"="36";
"10238"="38";
"10239"="40";
"10240"="45";
"10241"="51";
"10242"="54";
"10243"="57";
"10244"="64";
"10245"="72";
"10246"="76";
"10247"="81";
"10248"="91";
"10249"="One-Shot AF";
"10250"="AI Servo AF";
"10251"="AI Focus AF";
"10252"="Manual focusing";
"10253"="Single AF";
"10254"="Continuous AF";
"10255"="Manual Focus";
"10256"="Pan Focus";
"10257"="One-Shot AF / Single AF";
"10258"="+3";
"10259"="+2 2/3";
"10260"="+2 1/2";
"10261"="+2 1/3";
"10262"="+2";
"10263"="+1 2/3";
"10264"="+1 1/2";
"10265"="+1 1/3";
"10266"="+1";
"10267"="+2/3";
"10268"="+1/2";
"10269"="+1/3";
"10270"="0";
"10271"="-1/3";
"10272"="-1/2";
"10273"="-2/3";
"10274"="-1";
"10275"="-1 1/3";
"10276"="-1 1/2";
"10277"="-1 2/3";
"10278"="-2";
"10279"="-2 1/3";
"10280"="-2 1/2";
"10281"="-2 2/3";
"10282"="-3";
"10283"="-3  0  3";
"10284"="-2 2/3  0  2 2/3 ";
"10285"="-2 1/2  0  2 1/2";
"10286"="-2 1/3  0  2 1/3";
"10287"="-2  0  2";
"10288"="-1 2/3  0  1 2/3";
"10289"="-1 1/2  0  1 1/2";
"10290"="-1 1/3  0  1 1/3";
"10291"="-1  0  1";
"10292"="-2/3  0  2/3";
"10293"="-1/2  0  1/2";
"10294"="-1/3  0  1/3";
"10295"="0";
"10296"="Center-Weighted Average Metering";
"10297"="Spot Metering";
"10298"="Averaging Metering";
"10299"="Evaluative Metering";
"10300"="Partial Metering";
"10301"="Center-Weighted Average Metering";
"10302"="Auto";
"10303"="Daylight";
"10304"="Cloudy";
"10305"="Tungsten";
"10306"="Fluorescent";
"10307"="Flash";
"10308"="Custom";
"10309"="Black & White";
"10310"="Shade";
"10311"="Color Temperature";
"10312"="PCset1";
"10313"="PCset2";
"10314"="PCset3";
"10315"="PCset4";
"10316"="PCset5";
"10317"="Fluorescent H";
"10318"="Custom1";
"10319"="Custom2";
"10320"="Off";
"10321"="Auto";
"10322"="On";
"10323"="Auto";
"10324"="Slow Synchro";
"10325"="Auto";
"10326"="On";
"10327"="Large";
"10328"="Medium";
"10329"="Small";
"10330"="Medium2";
"10331"="Medium1";
"10332"="Medium3";
"10333"="Economy";
"10334"="Normal";
"10335"="Fine";
"10336"="RAW";
"10337"="Superfine";
"10338"="Manual selection - Center";
"10339"="No selection";
"10340"="Automatic selection";
"10341"="Manual selection - Right";
"10342"="Manual selection - Center";
"10343"="Manual selection - Left";
"10344"="Off";
"10345"="On";
"10346"="Normal";
"10347"="Contrast  Low";
"10348"="Contrast  Mid. Low";
"10349"="Contrast  High";
"10350"="Contrast  Mid. High";
"10351"="Contrast  Standard";
"10352"="Sharpness  Low";
"10353"="Sharpness  Mid. Low";
"10354"="Sharpness  High";
"10355"="Sharpness  Mid. High";
"10356"="Sharpness  Standard";
"10357"="Color Saturation  Low";
"10358"="Color saturation  Mid. low";
"10359"="Color saturation  High";
"10360"="Color saturation  Mid. High";
"10361"="Color saturation  Standard";
"10362"="Single shooting";
"10363"="Continuous shooting";
"10364"="Self-Timer Operation";
"10365"="Movie shooting";
"10366"="Continuous shooting(Speed priority)";
"10367"="Low-speed continuous shooting";
"10368"="High-speed continuous shooting";
"10369"="Silent single shooting";
"10370"="Latitude";
"10371"="Longitude";
"10372"="Altitude";
"10373"="Geographic coordinate system";
"10374"="OFF";
"10375"="ON";
"10376"="Off";
"10377"="On";
"10378"="Tone Curve  Standard";
"10379"="Tone Curve  Manual set";
"10380"="Tone Curve  Custom setting";
"10381"="Tone Curve  TCD1";
"10382"="Tone Curve  TCD2";
"10383"="Tone Curve  TCD3";
"10384"="Tone Curve  Custom setting";
"10385"="Sharpness level  0";
"10386"="Sharpness level  1";
"10387"="Sharpness level  2";
"10388"="Sharpness level  3";
"10389"="Sharpness level  4";
"10390"="Sharpness level  5";
"10391"="Sharpness  0";
"10392"="Sharpness  1";
"10393"="Sharpness  2";
"10394"="Sharpness  3";
"10395"="Sharpness  4";
"10396"="Sharpness  5";
"10397"="Sharpening Target  Rough";
"10398"="Sharpening Target  Mid. rough";
"10399"="Sharpening Target  Standard";
"10400"="Sharpening Target  Mid. fine";
"10401"="Sharpening Target  Fine";
"10402"="    0:Off";
"10403"="    1:On";
"10404"="    0:AF/AE lock";
"10405"="    1:AE lock /AF";
"10406"="    2:AF/AF lock";
"10407"="    3:AE+release/AE + AF";
"10408"="    0:Disable";
"10409"="    1:Enable";
"10410"="    0:1/2-stop";
"10411"="    1:1/3-stop";
"10412"="    0:On(Auto)";
"10413"="    1:Off";
"10414"="    0:Emits/Fires";
"10415"="    1:Does not emit/Fires";
"10416"="    2:Only ext. flash emits/Fires";
"10417"="    3:Emits/Does not fire";
"10418"="    0:Auto";
"10419"="    1:1/200(fixed)";
"10420"="    0:0 => - => +/Enabled";
"10421"="    1:0 => - => +/Disabled";
"10422"="    2:- => 0 => +/Enabled";
"10423"="    3:- => 0 => +/Disabled";
"10424"="    0:1st-curtain sync";
"10425"="    1:2nd-curtain sync";
"10426"="    0:AF stop";
"10427"="    1:AF start";
"10428"="    2:AE lock with metering";
"10429"="    0:Enable";
"10430"="    1:Disable";
"10431"="    0:top";
"10432"="    1:Previous( top if powered off )";
"10433"="    2:Previous";
"10434"="    0:Default";
"10435"="    1:Change quality";
"10436"="    2:Change ISO speed";
"10437"="    3:Change parameters";
"10438"="    0:Disable";
"10439"="    1:Enable";
"10440"="    0:On";
"10441"="    1:Off";
"10442"="    0:Possible without CF card";
"10443"="    1:Not possible";
"10444"="    0:[N] Ec-N,R";
"10445"="    1:[L] Ec-A,B,C,CII,CIII,D,H,I,L";
"10446"="    0:No viewfinder display";
"10447"="    1:Finder display on";
"10448"="    0:Possible without CF card";
"10449"="    1:Not possible";
"10450"="    0:Standard ISO";
"10451"="    1:Expanded sensitivity";
"10452"="    0:AF/AE lock";
"10453"="    1:AE lock/AF";
"10454"="    2:AF/AF lock, no AE lock";
"10455"="    3:AE/AF, no AE lock";
"10456"="    0:Tv value: Main dial, Av value: Quick Control dial";
"10457"="    1:Tv value: Quick Control dial, Av value: Main dial";
"10458"="    2:Tv value: Main dial, Av value: Quick Control dial, Av value can be set when lens removed";
"10459"="    3:Tv value: Quick Control dial, Av value: Main dial, Av value can be set when lens removed";
"10460"="    0:1/3-stop set, 1/3-stop comp.";
"10461"="    1:1-stop set, 1/3-stop comp.";
"10462"="    2:1/2-stop set, 1/2-stop comp.";
"10463"="    0:Turns on after One-Shot AF";
"10464"="    1:Turns off after One-Shot AF";
"10465"="    2:Always turned off";
"10466"="    0:Remain. shots/File No.";
"10467"="    1:ISO/Remain. Shots";
"10468"="    2:ISO/File No.";
"10469"="    3:Shots in folder/Remain. shots";
"10470"="    0:0,-,+/Auto cancellation";
"10471"="    1:0,-,+/No cancellation";
"10472"="    2:-,0,+/Auto cancellation";
"10473"="    3:-,0,+/No cancellation";
"10474"="    0:On";
"10475"="    1:Off";
"10476"="    2:On without dimming";
"10477"="    3:Brighter";
"10478"="    0:AF point selection button + Main (horizontal) / Quick Control (vertical) dial operation";
"10479"="    1:Exposure compensation button + Main (horizontal) / Quick Control (vertical) dial operation";
"10480"="    2:Quick Control dial only (horizontal), Assist button + Main dial operation (vertical)";
"10481"="    3:FE lock button + Main (horizontal) / Quick Control (vertical) dial operation";
"10482"="    0:Disable";
"10483"="    1:Enable";
"10484"="    0:45/Center AF point";
"10485"="    1:11/Active AF point";
"10486"="    2:11/Center AF point";
"10487"="    3:9/Active AF point";
"10488"="    0:Enable";
"10489"="    1:Disable";
"10490"="    0:1st-curtain synchronization";
"10491"="    1:2nd-curtain synchronization";
"10492"="    0:Disable";
"10493"="    1:Enable";
"10494"="    0:Single AF point";
"10495"="    1:Expand(TTL. of 7 AF points)";
"10496"="    2:Automatic expand(max. 13)";
"10497"="    0:Assist button + AF point selection button";
"10498"="    1:Switch using assist button only";
"10499"="    2:Only switch while assist button is pressed";
"10500"="    0:AF stop";
"10501"="    1:AF start";
"10502"="    2:AE lock while metering";
"10503"="    3:AF point:M->Auto/Auto->Ctr.";
"10504"="    4:AF mode:ONE SHOT<-->AI SERVO";
"10505"="    5:IS start";
"10506"="    0:Standard";
"10507"="    1:Slow";
"10508"="    2:Moderately slow";
"10509"="    3:Moderately fast";
"10510"="    4:Fast";
"10511"="Auto";
"10512"="None";
"10513"="x 2";
"10514"="x 4";
"10515"="On";
"10516"="Off";
"10517"="Built-In Flash";
"10518"="External E-TTL";
"10519"="External A-TTL";
"10520"="1st-curtain sync";
"10521"="2nd-curtain sync";
"10522"="Hi-speed";
"10523"="[ Right ]";
"10524"="[ Center ]";
"10525"="[ Right Center ]";
"10526"="[ Left ]";
"10527"="[ Left Right ]";
"10528"="[ Left Center ]";
"10529"="[ Left Center Right ]";
"10530"="%m/%d/%y %H:%M:%S";
"10531"="mm";
"10532"="KB";
"10533"="(%dK)";
"10534"="Off";
"10535"="Vivid";
"10536"="Neutral";
"10537"="Low Sharpening";
"10538"="Sepia";
"10539"="Black & White";
"10540"="Custom";
"10541"="Macro";
"10542"="Snap";
"10543"="Landscape";
"10544"="Off";
"10545"="On 1";
"10546"="On 2";
"10547"="On";
"10548"="Auto";
"10549"="Contrast      -2";
"10550"="Contrast      -1";
"10551"="Contrast       0";
"10552"="Contrast      +1";
"10553"="Contrast      +2";
"10554"="Color tone    -2";
"10555"="Color tone    -1";
"10556"="Color tone    0";
"10557"="Color tone    +1";
"10558"="Color tone    +2";
"10559"="Filter effect  None";
"10560"="Filter effect  Yellow";
"10561"="Filter effect  Orange";
"10562"="Filter effect  Red";
"10563"="Filter effect  Green";
"10564"="Toning effect  None";
"10565"="Toning effect  Sepia";
"10566"="Toning effect  Blue";
"10567"="Toning effect  Purple";
"10568"="Toning effect  Green";
"10569"="sRGB";
"10570"="Adobe RGB";
"10571"="Color Space   sRGB";
"10572"="Color Space   Adobe RGB";
"10573"="1Standard";
"10574"="2Portrait";
"10575"="3H-saturat.";
"10576"="4Adobe RGB";
"10577"="5L-saturat.";
"10578"="6CM set1";
"10579"="7CM set2";
"10580"="---------";
"10581"="Large";
"10582"="Medium1";
"10583"="Medium2";
"10584"="Small";
"10585"="Av";
"10586"="Tv";
"10587"="P";
"10588"="M";
"10589"="Bulb";
"10590"="A-DEP";
"10591"="DEP";
"10592"="---";
"10593"="Picture Style";
"10594"="Sharpness";
"10595"="Contrast";
"10596"="Saturation";
"10597"="Color tone";
"10598"="Filter effect";
"10599"="Toning effect";
"10600"="-4";
"10601"="-3";
"10602"="-2";
"10603"="-1";
"10604"="0";
"10605"="1";
"10606"="2";
"10607"="3";
"10608"="4";
"10609"="5";
"10610"="6";
"10611"="7";
"10612"="N :None";
"10613"="Ye:Yellow";
"10614"="Or:Orange";
"10615"="R :Red";
"10616"="G :Green";
"10617"="S :Sepia";
"10618"="B :Blue";
"10619"="P :Purple";
"10620"="Standard";
"10621"="Portrait";
"10622"="Landscape";
"10623"="Neutral";
"10624"="Faithful";
"10625"="Monochrome";
"10626"="User Defined 1";
"10627"="User Defined 2";
"10628"="User Defined 3";
"10629"="SRAW";
"10630"="Date/Time(UTC)";
"10631"="Satellite signal status";
"10632"="OK";
"10633"="NG";
"10634"="Long exposure noise reduction";
"10635"="High ISO speed noise reduction";
"10636"="Highlight tone priority";
"10637"="0:Off";
"10638"="1:Auto";
"10639"="2:On";
"10640"="0:Off";
"10641"="1:On";
"10642"="0:Disable";
"10643"="1:Enable";
"10644"="External TTL";
"10645"="Auto External Metering";
"10646"="Manual External Metering";
"10647"="Manual Flash";
"10648"="Author";
"10649"="Copyright Notice";
"10650"="Auto Lighting Optimizer";
"10651"="0:Standard";
"10652"="1:Low";
"10653"="2:Strong";
"10654"="3:Disable";
"10655"="0:Standard";
"10656"="1:Low";
"10657"="2:Strong";
"10658"="3:Disable";
"10659"="Firmware";
"10660"="AE lock";
"10661"="OFF";
"10662"="ON";
"10663"="Auto ISO Speed";
"10664"="OFF";
"10665"="ON";
"10666"="FE lock";
"10667"="OFF";
"10668"="ON";
"10669"="Peripheral illumination correction";
"10670"="Disable";
"10671"="Enable";
"10672"="Dust Delete Data";
"10673"="No";
"10674"="Yes";
"10675"="Live View Shooting";
"10676"="OFF";
"10677"="ON";
"10678"="E-TTL II flash metering";
"10679"="Evaluative flash metering";
"10680"="Average flash metering";
"10681"="SRAW1";
"10682"="SRAW2";
"10683"="MRAW";
"10684"="Creative Auto";
"10685"="Photo in Movie / MovieSnap";
"10686"="AE Microadjustment";
"10687"="FE Microadjustment";
"10688"="AF area select mode";
"10689"="Manual selection";
"10690"="Spot AF";
"10691"="AF Point expansion";
"10692"="Zone AF";
"10693"="Automatic selection";
"10694"="Movie Crop";
"10695"="Ambience";
"10696"="Standard setting";
"10697"="Vivid";
"10698"="Warm";
"10699"="Soft";
"10700"="Cool";
"10701"="Intense";
"10702"="Darker";
"10703"="Brighter";
"10704"="Monochrome";
"10705"="Effect";
"10706"="Strong";
"10707"="Standard";
"10708"="Low";
"10709"="Low";
"10710"="Medium";
"10711"="High";
"10712"="Sepia";
"10713"="B/W";
"10714"="Blue";
"10715"="Lighting or Scene";
"10716"="Default setting";
"10717"="Daylight";
"10718"="Shade";
"10719"="Cloudy";
"10720"="Tungsten light";
"10721"="Fluorescent light";
"10722"="Sunset";
"10723"="RAW image processing";
"10724"="Distortion correction";
"10725"="Chromatic aberration correction";
"10726"="Resize";
"10727"="Creative filters";
"10728"="Grainy B/W";
"10729"="Soft focus";
"10730"="Toy camera effect";
"10731"="Miniature effect";
"10732"="Creative filter adjustment";
"10733"="Contrast:Standard";
"10734"="Contrast:Low";
"10735"="Contrast:Strong";
"10736"="Color tone:Standard";
"10737"="Color tone:Cool tone";
"10738"="Color tone:Warm tone";
"10739"="Soft focus:Standard";
"10740"="Soft focus:Low";
"10741"="Soft focus:Strong";
"10742"="Aspect ratio";
"10743"="1:1";
"10744"="3:2";
"10745"="4:3";
"10746"="16:9";
"10747"="Movie exposure";
"10748"="Auto";
"10749"="Manual";
